================================================================================
Ellipsis
================================================================================

...

--------------------------------------------------------------------------------

(source_file
  (semgrep_ellipsis))

================================================================================
Top level statements
================================================================================

foo()
...
bar()

--------------------------------------------------------------------------------

(source_file
  (call_expression
    (identifier)
    (argument_list))
  (semgrep_ellipsis)
  (call_expression
    (identifier)
    (argument_list)))

================================================================================
Top level public constructor
================================================================================

function f(...)
  return 1
end

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (parameter_list
      (typed_parameter
        (semgrep_ellipsis)))
    (return_statement
      (integer_literal))))

================================================================================
Abstract type metavariable
================================================================================

abstract type $TY end

--------------------------------------------------------------------------------

(source_file
  (abstract_definition
    (identifier)))

================================================================================
Struct metavariable
================================================================================

struct $FOO
  a
  b
end

--------------------------------------------------------------------------------

(source_file
  (struct_definition
    (identifier)
    (identifier)
    (identifier)))

================================================================================
Ellipsis args
================================================================================

foo(..., 5)

--------------------------------------------------------------------------------

(source_file
  (call_expression
    (identifier)
    (argument_list
      (semgrep_ellipsis)
      (integer_literal))))

================================================================================
Ellipsis in if
================================================================================

if (...)
  ...
end

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (parenthesized_expression
      (semgrep_ellipsis))
    (semgrep_ellipsis)))

================================================================================
Metavariable
================================================================================

function $F()
  $X = 2
  return $Y
end

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (parameter_list)
    (assignment
      (identifier)
      (operator)
      (integer_literal))
    (return_statement
      (identifier))))

================================================================================
Catch ellipsis
================================================================================

try
  x = 3
catch ...
  ...
end

--------------------------------------------------------------------------------

(source_file
  (try_statement
    (assignment
      (identifier)
      (operator)
      (integer_literal))
    (catch_clause
      (catch_ellipsis)
      (semgrep_ellipsis))))

================================================================================
Empty catch followed by ellipsis
================================================================================

try
  x = 3
catch
  ...
end

--------------------------------------------------------------------------------

(source_file
  (try_statement
    (assignment
      (identifier)
      (operator)
      (integer_literal))
    (catch_clause
      (semgrep_ellipsis))))

================================================================================
Using on metavariable
================================================================================

using $MODULE: $X
using $MODULE: $X as $Y

--------------------------------------------------------------------------------

(source_file
  (import_statement
    (selected_import
      (identifier)
      (identifier)))
  (import_statement
    (selected_import
      (identifier)
      (import_alias
        (identifier)
        (identifier)))))

================================================================================
Import on metavariable
================================================================================

import $MODULE: $X as $Y

--------------------------------------------------------------------------------

(source_file
  (import_statement
    (selected_import
      (identifier)
      (import_alias
        (identifier)
        (identifier)))))