================================================================================
Ellipsis
================================================================================

...

--------------------------------------------------------------------------------

(source_file
  (semgrep_ellipsis))

================================================================================
Top level statements
================================================================================

foo()
...
bar()

--------------------------------------------------------------------------------

(source_file
  (call_expression
    (identifier)
    (argument_list))
  (semgrep_ellipsis)
  (call_expression
    (identifier)
    (argument_list)))

================================================================================
Top level public constructor
================================================================================

function f(...) 
  return 1
end

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (parameter_list
      (typed_parameter
        (semgrep_ellipsis)))
    (return_statement
      (integer_literal))))

================================================================================
Abstract type metavariable
================================================================================

abstract type $TY end

--------------------------------------------------------------------------------

(source_file
  (abstract_definition
    (identifier)))

================================================================================
Struct metavariable
================================================================================

struct $FOO 
  a
  b
end

--------------------------------------------------------------------------------

(source_file
  (struct_definition
    (identifier)
    (identifier)
    (identifier)))

================================================================================
Ellipsis args
================================================================================

foo(..., 5)

--------------------------------------------------------------------------------

(source_file
  (call_expression
    (identifier)
    (argument_list
      (semgrep_ellipsis)
      (integer_literal))))

================================================================================
Ellipsis in if
================================================================================

if (...) 
  ...
end

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (parenthesized_expression
      (semgrep_ellipsis))
    (semgrep_ellipsis)))

================================================================================
Metavariable
================================================================================

function $F()
  $X = 2
  return $Y
end

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (parameter_list)
    (assignment
      (identifier)
      (operator)
      (integer_literal))
    (return_statement
      (identifier))))

================================================================================
Metavariable where only an identifier can appear
================================================================================

$FUN(...) do $X 
  ...
end

--------------------------------------------------------------------------------

(source_file
  (call_expression
    (identifier)
    (argument_list
      (semgrep_ellipsis))
    (do_clause
      (parameter_list
        (identifier))
      (semgrep_ellipsis))))
